const dummy = [
  {
    BID: 347,
    TITLE: "따라하면서 배우는 파이썬",
    SUBTITLE: null,
    AUTHOR: "이상철 지음",
    ISBN: "9791166750908",
    PUBLISHER: "복두출판사",
    PRICE: "13,000원",
    PAGE: "212쪽",
    BOOK_INDEX:
      "PART 1 파이썬 기초       ^^1장 파이썬 개발환경 설정       ^^1.1 개요       ^^1.2 파이썬 설치하기       ^^1.3 파이참 설치하기       ^^1.4 파이썬 코딩 처음 실행해보기       ^^^^2장 변수와 연산자       ^^2.1 변수       ^^2.2 연산자       ^^2.3 변수와 연산자 실습       ^^3장 조건문       ^^3.1 if문       ^^3.2 if ~ else 문       ^^3.3 if ~ elif ~ else 문       ^^3.4 한문장 if ~ else 문       ^^^^4장 반복문       ^^4.1 for문       ^^4.2 while문       ^^^^5장 함수       ^^5.1 함수의 개요       ^^5.2 함수정의       ^^5.3 함수사용       ^^^^^^PART 2 파이썬 응용 ^^6장 파이썬으로 수학문제 풀기       ^^6.1 수와 연산       ^^6.2 1차함수와 그래프       ^^6.3 통계       ^^^^7장 PyGame       ^^7.1 PyGame 기본 틀       ^^7.2 화면에 이미지 표시하기       ^^7.3 이미지 이동하기       ^^7.4 화면에 사각형 그리기       ^^7.5 사각형과 공의 충돌감지       ^^7.6 키입력 받아서 paddle 조정하기       ^^7.7 화면 상단에 벽돌 나타내기       ^^^^^^부록^^부록 A 비트연산자와 연산자 우선순위       ^^A.1 비트연산자       ^^A.2 연산자 우선순위       ^^^^부록 B 클래스       ^^B.1 클래스 개요       ^^B.2 클래스의 정의       ^^B.3 클래스 사용하기       ^^^^부록 C 리스트, 튜플, 딕셔너리       ^^C.1 리스트 개념과 형식       ^^C.2 리스트 사용방법       ^^C.3 튜플 개념과 형식       ^^C.4 튜플 사용방법       ^^C.5 딕셔너리 개념과 형식       ^^C.6 딕셔너리 사용방법       ^^^^부록 D numpy       ^^D.1 numpy 모듈 설치하기       ^^^^부록 E matplotlib       ^^E.1 matplotlib 모듈 설치하기       ^^^^부록 F pygame       ^^F.1 pygame 모듈 설치하기       ^^^^부록 G 벽돌깨기 소스코드       접기",
    BOOK_INTRODUCTION:
      "4차 산업혁명 시대에 대비한 교육으로 컴퓨팅적 사고력과 문제해결 능력 등 코딩에 관한 마인드 고취와 저변 확대를 위한 흥미 유발과 함께 현재 산업체에서의 요구가 많은 소규모 프로젝트 형태로 따라하면서 코딩을 익혀서 미래의 기술에 적응할 수 있는 역량과 관련되고 도움이 될 내용으로 본 교재를 개발하게 되었다. 학습 대상 범위는 코딩에 관심 있는 중학생 이상이면 누구나 배울 수 있고 배운 것을 매우 유용하게 활용할 수 있도록 집필하였다.",
    PUBLISH_DATE: "2021-12-01",
    Allah_BID: "286334821",
    thumbnailImage: "http://203.255.3.144:8010/thumbnail/286334821.png",
  },
  {
    BID: 3,
    TITLE: "공학텍스트북 파이썬 수치해석",
    SUBTITLE: null,
    AUTHOR: "Qingkai Kong 외 지음, 이광수 옮김",
    ISBN: "9791189057312",
    PUBLISHER: "휴먼싸이언스",
    PRICE: "33,000원",
    PAGE: "215쪽",
    BOOK_INDEX:
      "차례^^^^CHAPTER^^1^^파이썬 기초^^1.1       파이썬 시작하기       1^^1.1.1       작업 환경 설정       1^^1.1.2       파이썬 코드를 실행하는 세 가지 방법       5^^1.2       파이썬을 계산기로 사용하기       8^^1.3       패키지 관리       14^^1.3.1       패키지 관리자를 사용하여 패키지 관리하기       14^^1.3.2       소스 파일을 이용한 패키지 설치       17^^1.4       주피터 노트북 개요       17^^1.4.1       주피터 노트북 시작하기       18^^1.4.2       노트북 내에서의 활동       19^^1.4.3       노트북을 닫는 방법       20^^1.4.4       주피터 노트북 서버 종료       20^^1.5       논리식과 연산자       20^^1.6       요약, 그리고 문제       23^^1.6.1       요약       23^^1.6.2       문제       23^^^^^^CHAPTER^^2^^변수와 기본 데이터 구조^^2.1       변수와 지정       27^^2.2       데이터 구조-문자열       30^^2.3       데이터 구조-리스트       36^^2.4       데이터 구조-투플       39^^2.5       데이터 구조-집합       42^^2.6       데이터 구조-사전       43^^2.7       NumPy 배열 개요       45^^2.8       요약, 그리고 문제       54^^2.8.1       요약       54^^2.8.2       문제       55^^^^CHAPTER^^3^^함수^^3.1       함수의 기초       57^^3.1.1       파이썬의 내장 함수       57^^3.1.2       함수 정의       58^^3.2       지역 변수와 전역 변수       66^^3.3       중첩 함수       70^^3.4       람다 함수       72^^3.5       함수에 대한 인수로서의 함수       73^^3.6       요약, 그리고 문제       75^^3.6.1       요약       75^^3.6.2       문제       75^^^^^^CHAPTER^^4^^분기문^^4.1       if-else 문       81^^4.2       3항 연산자       88^^4.3       요약, 그리고 문제       89^^4.3.1       요약       89^^4.3.2       문제       89^^^^^^CHAPTER^^5^^반복^^5.1       for 루프       95^^5.2       while 루프       102^^5.3       조건제시법       104^^5.3.1       리스트에 대한 조건제시법       105^^5.3.2       사전에 대한 조건제시법       106^^5.4       요약, 그리고 문제       106^^5.4.1       요약       106^^5.4.2       문제       106^^^^^^CHAPTER^^6^^재귀법^^6.1       재귀 함수       111^^6.2       분할 정복법       117^^6.2.1       하노이 탑       117^^6.2.2       퀵 정렬       120^^6.3       요약, 그리고 문제       121^^6.3.1       요약       121^^6.3.2       문제       121^^^^^^CHAPTER^^7^^객체지향 프로그래밍^^7.1       객체 지향 프로그래밍 개요       129^^7.2       클래스와 객체       131^^7.2.1       클래스       131^^7.2.2       객체       133^^7.2.3       클래스 속성 대 인스턴스 속성       135^^7.3       상속, 캡슐화, 다형성       136^^7.3.1       상속       136^^7.3.2       캡슐화       140^^7.3.3       다형성       142^^7.4       요약, 그리고 문제       142^^7.4.1       요약       142^^7.4.2       문제       143^^^^^^CHAPTER^^8^^복잡도^^8.1       복잡도와 Big-O 표기법       145^^8.2       복잡도의 중요성       148^^8.3       프로파일러       150^^8.3.1       매직 명령 사용하기       150^^8.3.2       파이썬 프로파일러 사용       151^^8.3.3       라인 프로파일러 사용       152^^8.4       요약, 그리고 문제       153^^8.4.1       요약       153^^8.4.2       문제       154^^^^^^CHAPTER^^9^^숫자의 표현^^9.1       N진법과 이진법       157^^9.2       부동 소수점 실수       159^^9.3       반올림 오차       164^^9.3.1       표현 오차       164^^9.3.2       부동 소수점 연산에 의한 반올림 오차       164^^9.3.3       반올림 오차의 누적       165^^9.4       요약, 그리고 문제       166^^9.4.1       요약       166^^9.4.2       문제       167^^^^^^CHAPTER^^10^^오류, 좋은 프로그래밍 습관, 그리고 디버깅^^10.1       오류 유형       171^^10.2       오류의 방지       174^^10.2.1              프로그램을 계획하라       174^^10.2.2              모든 코드를 자주 테스트하라       175^^10.2.3              코드를 깨끗하게 유지하라       176^^10.3       try/except       178^^10.4       데이터 유형 검사       181^^10.5       디버깅       183^^10.5.1              예외가 발생한 후 디버거 활성화       184^^10.5.2              코드를 실행하기 전에 디버거 활성화       186^^10.5.3              중단점 추가       187^^10.6       요약, 그리고 문제       188^^10.6.1              요약       188^^10.6.2              문제       188^^^^^^CHAPTER^^11^^파일 입출력^^11.1       TXT 파일       189^^11.1.1              파일에 쓰기       190^^11.1.2              파일에 추가하기       191^^11.1.3              파일 읽기       192^^11.1.4              숫자와 배열의 처리       193^^11.2       CSV 파일       194^^11.2.1              CSV 파일 쓰기와 열기       194^^11.2.2              CSV 파일 읽기       196^^11.2.3              NumPy 외의 방법       196^^11.3       pickle 파일       196^^11.3.1              pickle 파일에 쓰기       197^^11.3.2              pickle 파일 읽기       197^^11.3.3              파이썬 2에서 pickle 파일 읽기       197^^11.4       JSON 파일       198^^11.4.1              JSON 형식       198^^11.4.2              JSON 파일에 쓰기       199^^11.4.3              JSON 파일 읽기       200^^11.5       HDF5 파일       200^^11.5.1              HDF5 파일 읽기       202^^11.6       요약, 그리고 문제       203^^11.6.1              요약       203^^11.6.2              문제       203^^^^^^CHAPTER^^12^^시각화와 플로팅^^12.1       2D 플로팅       205^^12.2       3D 플로팅       216^^12.3       지도 작업       222^^12.4       애니메이션과 동영상       229^^12.5       요약, 그리고 문제       232^^12.5.1              요약       232^^12.5.2              문제       232^^^^^^CHAPTER^^13^^파이썬 코드의 병렬화^^13.1       병렬 컴퓨팅의 기초       241^^13.1.1              프로세스와 쓰레드       243^^13.1.2              파이썬의 GIL 문제       243^^13.1.3              병렬 컴퓨팅 사용의 단점       243^^13.2       multiprocessing 모듈       244^^13.2.1       실행 시간의 시각화       245^^13.3       joblib의 사용       247^^13.4       요약, 그리고 문제       248^^13.4.1              요약       248^^13.4.2              문제       249^^^^^^CHAPTER^^14^^선형대수와 선형 연립방정식^^14.1       선형대수의 기초       251^^14.1.1              집합       251^^14.1.2              벡터       252^^14.1.3              행렬       256^^14.2       선형 변환       261^^14.3       선형 연립방정식       262^^14.4       선형 연립방정식의 풀이       264^^14.4.1              가우스 소거법       265^^14.4.2              가우스-조던 소거법       267^^14.4.3              LU 분해법       269^^14.4.4              반복법 - 가우스-자이델 방법       271^^14.5       파이썬에서 선형 연립방정식 풀기       274^^14.6       역행렬 계산       276^^14.7       요약, 그리고 문제       279^^14.7.1              요약       279^^14.7.2              문제       279^^^^^^CHAPTER^^15^^고윳값과 고유벡터^^15.1       고윳값과 고유벡터 개요       283^^15.1.1              고윳값과 고유벡터       283^^15.1.2              고윳값과 고유벡터의 배경       283^^15.1.3              특성 방정식       286^^15.2       누승법       287^^15.2.1              가장 큰 고윳값 찾기       287^^15.2.2              역 누승법       290^^15.2.3              이동 누승법       291^^15.3       QR 방법       292^^15.4       파이썬에서 고윳값과 고유벡터 구하기       294^^15.5       요약, 그리고 문제       295^^15.5.1              요약       295^^15.5.2              문제       295^^^^^^CHAPTER^^16^^최소제곱 회귀^^16.1       최소제곱 회귀 개요       297^^16.2       최소제곱 회귀의 유도(선형대수 기반)       298^^16.3       최소제곱 회귀의 유도(다변량 미적분 기반)       300^^16.4       파이썬에서 최소제곱 회귀의 수행       301^^16.4.1              역행렬을 직접 사용하는 방법       302^^16.4.2              의사 역행렬의 사용       303^^16.4.3              numpy.linalg.lstsq의 사용       304^^16.4.4              SciPy의 optimize.curve_fit 사용하기       304^^16.5       비선형 함수에 대한 최소제곱 회귀       305^^16.5.1              지수 함수에 대한 로그 기법       305^^16.5.2              멱승 함수에 대한 로그 기법       307^^16.5.3              다항식 회귀       307^^16.5.4              SciPy의 optimize.curve_fit 사용하기       309^^16.6       요약, 그리고 문제       310^^16.6.1              요약       310^^16.6.2              문제       310^^^^^^CHAPTER^^17^^보간법^^17.1       보간 문제       313^^17.2       선형 보간법       314^^17.3       3차 스플라인 보간법       315^^17.4       라그랑주 다항식 보간법       320^^17.4.1              SciPy의 lagrange 함수 사용하기       322^^17.5       뉴턴의 다항식 보간법       323^^17.6       요약, 그리고 문제       327^^17.6.1       요약       327^^17.6.2       문제       327^^^^^^CHAPTER^^18^^테일러급수^^18.1       테일러급수를 이용한 함수 표현       333^^18.2       테일러급수를 사용한 근사       334^^18.3       오차에 대한 논의       338^^18.3.1              테일러급수의 절삭 오차       338^^18.3.2              절삭 오차의 추정       339^^18.3.3              테일러급수의 반올림 오차       340^^18.4       요약, 그리고 문제       341^^18.4.1              요약       341^^18.4.2              문제       341^^^^^^CHAPTER^^19^^근의 계산^^19.1       근을 구하는 문제       343^^19.2       허용 오차       344^^19.3       이분법       345^^19.4       뉴턴-랩슨 방법       348^^19.5       파이썬에서 근의 계산       351^^19.6       요약, 그리고 문제       351^^19.6.1              요약       351^^19.6.2              문제       352^^^^^^CHAPTER^^20^^수치 미분^^20.1       수치 미분 문제       355^^20.2       도함수 근사를 위한 유한 차분의 사용       356^^20.2.1              테일러급수로 도함수 근사를 위한 유한 차분의 사용       357^^20.3       고차 도함수의 근사       363^^20.4       노이즈가 있는 수치 미분       364^^20.5       요약, 그리고 문제       366^^20.5.1              요약       366^^20.5.2              문제       366^^^^^^CHAPTER^^21^^수치 적분^^21.1       수치 적분 문제       371^^21.2       리만 적분       372^^21.3       사다리꼴 공식       375^^21.4       심슨의 공식       378^^21.5       파이썬에서의 적분 계산       382^^21.6       요약, 그리고 문제       385^^21.6.1              요약       385^^21.6.2              문제       385^^^^^^CHAPTER^^22^^상미분방정식(ODE) 초깃값 문제^^22.1       ODE 초깃값 문제       391^^22.2       계수의 감소       394^^22.3       오일러 방법       396^^22.4       수치 오차와 불안정성       401^^22.5       예측자-수정자 방법과 룽게-쿠타 방법       403^^22.5.1       예측자-수정자 방법       403^^22.5.2       룽게-쿠타 방법       404^^22.6       파이썬의 ODE 풀이 함수       406^^22.7       고급 주제       411^^22.7.1              다단계 방법       411^^22.7.2              경직성 ODE       411^^22.8       요약, 그리고 문제       412^^22.8.1              요약       412^^22.8.2              문제       413^^^^^^CHAPTER^^23^^상미분방정식(ODE)의 경곗값  문제^^23.1       ODE 경곗값 문제       421^^23.2       사격법       423^^23.3       유한 차분법       428^^23.4       수치 오차와 불안정성       433^^23.5       요약, 그리고 문제       433^^23.5.1              요약       433^^23.5.2              문제       434^^^^^^CHAPTER^^24^^푸리에 변환^^24.1       파동의 기초       437^^24.1.1              수학적 도구를 사용한 파동 모델링       438^^24.1.2              파동의 특성       439^^24.2       이산 푸리에 변환(DFT)       443^^24.2.1              DFT       445^^24.2.2              역 DFT       449^^24.2.3              DFT의 한계       449^^24.3       고속 푸리에 변환(FFT)       450^^24.3.1              DFT의 대칭성       451^^24.3.2              Cooley-Tukey FFT 알고리즘       451^^24.4       파이썬에서의 FFT       455^^24.4.1              NumPy의 FFT       456^^24.4.2              SciPy의 FFT       457^^24.4.3              추가 예제       458^^24.5       요약, 그리고 문제       463^^24.5.1              요약       463^^24.5.2              문제       464^^^^^^APPENDIX^^A^^윈도우에서 파이썬 시작하기^^A.1       윈도우에서 파이썬 시작하기       467^^A.1.1 윈도우에서 작업 환경 설정       467^^A.1.2 파이썬 코드를 실행하는 세 가지 방법       471^^^^찾아보기       475접기",
    BOOK_INTRODUCTION: null,
    PUBLISH_DATE: "2022-02-18",
    Allah_BID: "288830929",
    thumbnailImage: "http://203.255.3.144:8010/thumbnail/288830929.png",
  },
  {
    BID: 10580,
    TITLE: "IT 시스템 개발 철저공략",
    SUBTITLE: "철저공략 시리즈",
    AUTHOR: "니시자와 스스무 외 지음, 김대희 옮김",
    ISBN: "9788994774633",
    PUBLISHER: "원제 : ITシステム開發徹底攻略",
    PRICE: "26,000원",
    PAGE: "356쪽",
    BOOK_INDEX:
      "시작기획. 앞으로 10년, 어떻게 살아남을 것인가?^^^^1장. 지금까지의 10년을 돌아본다^^--시작하며^^--최근 10년간을 뒤돌아본다^^--업계의 라이프 사이클^^--35세 정년설을 고민하다^^^^2장. 앞으로의 10년을 생각한다^^--10년 후 자신의 모습^^--10개년 계획^^--자기 자신이 진정으로 목표로 해야 할 것은 무엇인가?^^--로드맵을 그린다^^--1년에 한 번은 다시 돌아본다^^--지도를 만들어서 달려보자^^^^3장. 살아남는 방법 ^^--지도와 현실이 다르다는 것^^--문제란 무엇인가?^^--문제 구조 분석^^--앞으로의 10년을 향하여^^^^특집 1. 요건 정의의 지혜와 도구^^^^1장. 누구를 위한 공정인가?^^--시작하며 ^^--요건 정의 ^^--희망, 요구, 요건 ^^--Why, What, How ^^^^2장. 매지카의 방법으로 현재 상태를 파악한다^^--업무 프로세스를 작성하는 이유 ^^--업무 매지카 작성 방법 ^^--매지카 사용 방법: 상편 ^^--매지카 작성 방법: 중편 ^^--매지카 작성 방법: 하편 ^^--현실이 파악된다면 ^^^^3장. 희망의 근원을 찾아라!^^--업무를 바꾼다! ^^--희망을 뒤집으면 불만 ^^--원인 추구형: 일에는 인과관계가 있다 ^^--강력한 탑다운형: 있어야 할 형태를 정의한다 ^^--있어야 하는 형태를 향하여 현실을 바꾼다 ^^^^4장. UI 스케치, 워크스루 ^^--업무 프로세스와 UCD ^^--UI 스케치 ^^--워크스루^^^^5장. 최선의 UI와 단순한 UI를 조화시킨다 ^^--업무 설계로서의 UI 설계 ^^--메시지도 업무 프로세스다 ^^--UI 사전^^--분기를 없앤다 ^^--역할, 권한, 업무 프로세스, UI, 요건 ^^--마지막으로^^^^특집 2. 시스템 설계의 기초 지식^^^^1장. 요건 확인과 사양 정의 ^^--시작하며 ^^--요건의 확인 ^^--업무 규칙에 대하여 ^^--요건의 체크포인트 ^^--정합성을 확인한다 ^^--사양 정의 ^^^^2장. 시스템 설계 ^^--설계를 실시한다 ^^--구조를 정한다 ^^--데이터 보관 방법을 정한다 ^^--화면과의 구분을 결정한다 ^^--출력 장표를 확인한다 ^^--작성 단위와 순서를 결정한다 ^^--작성 단위별로 설계서를 작성함 ^^--설계서의 누락을 확인한다 ^^^^3장. 개발 공정으로 인계 ^^--개발 담당자에게 전달  ^^--프로그램이 완성되기 전에 ^^--마지막으로, 좋은 설계를 위하여^^^^특집 3. 프로젝트 관리 입문^^^^1장. 프로젝트 재고 ^^--시작하며 ^^--프로젝트란? ^^--프로젝트를 구성하는 3요소 ^^--세 가지 요소 간의 트레이드 오프(Trade-off) ^^^^2장. 관리 기법을 어떻게 파악할 것인가? ^^--시작하며 ^^--프로젝트 관리의 정의 ^^--프로젝트 관리의 필요성 ^^--프로젝트를 성공으로 이끌기 위한 방법 ^^^^3장. 프로젝트는 왜 실패하는가? ^^--시작하며 ^^--프로젝트의 실패 원인 ^^--프로젝트의 계획이 미진한 채 진행하는 것과 그 결과 ^^--해야만 할 것을 확실히 한다 ^^--위험 관리 ^^^^4장. 프로젝트 운영 시 임기응변 대처 포인트 ^^--시작하며 ^^--프로젝트 관리의 기본적인 흐름 ^^--프로젝트 관리의 작업 순서 ^^--착수 단계에서의 프로젝트 정의 ^^--계획?수행 단계에서의 위험 관리 ^^^^5장. IT 프로젝트 관리자의 역할 ^^--시작하며 ^^--프로듀서와 디렉터 ^^--프로젝트 관리자는 프로듀서인가, 디렉터인가? ^^--디렉터 업무에 주력하여 근시안적 상태가 되어 버리는 위험성 ^^--프로젝트 관리자는 기술을 알지 못해도 좋은가? ^^--최신 기술을 추종함으로써 발생하는 장점과 단점 ^^--프로젝트 관리자는 최종 병력! ^^--마지막으로^^^^특집 4. 분야별 업무 시스템의 기초 지식^^^^1장. 업무 시스템의 기본 모델 ^^--기업 시스템의 기본 모델^^2장. 영업?판매?유통계 시스템 ^^--예상생산과 수주생산 ^^--영업 대상은 소비자에 한하지 않음 ^^--영업지원 시스템 ^^--일반적인 유통의 형태 ^^--재고관리 시스템 ^^--지불 방법 ^^--판매관리 시스템 ^^--인터넷을 활용한 구매 시스템 ^^^^3장. 생산관리?원가관리계 시스템 ^^--생산관리란 무엇을 하는 것인가? ^^--생산관리 시스템의 개요 ^^--어떠한 사람이 사용하는가? ^^--최근의 생산관리 시스템 ^^--정리하며 ^^^^4장. 인사?총무?회계 시스템 ^^--시작하며 ^^--인사부는 어떤 업무를 하는가?  ^^--인사 시스템이란 어떤 시스템인가? ^^--총무란 어떤 것을 하는 것인가? ^^-총무 시스템이란 어떠한 시스템인가? ^^--회계 시스템이란 어떤 시스템인가? ^^--인사?총무?회계 시스템과의 연결 ^^^^5장. 화이트칼라 지원 계통 시스템 ^^--시작하며 ^^--화이트칼라의 일반적인 업무 ^^--시스템 기능 구성 예 ^^^^6장. 복합적 시스템을 어떻게 분석할 것인가?  ^^--흐름과 연관성으로 생각한다 ^^--마지막으로^^^^특집 5. 문서 작성 기술^^^^1장. 문서 작성의 기본과 마음가짐 ^^--시작하며 ^^--문서 작성은 어렵다 ^^--무엇을 설계할까? 우선은 목적부터 ^^--문서의 목표 ^^--요점은 대상 독자와 기재 내용 ^^--작성 내용 수준과 그 다음 ^^^^2장. 설계서 ^^--시작하며 ^^--목적 - 오해 없이 정확하게 이해?파악하는 것 ^^--읽는 사람 - 전문가 외에도 알기 쉽게 ^^--목표 - 정확함과 간단함 ^^--기술 문서의 설계 ^^^^3장. 매뉴얼 ^^--목적 - 시스템을 실제로 사용할 수 있도록 하는 중개역할 ^^--읽는 사람 - 시스템?상품을 모르는 사람 ^^--목차의 중요성 ^^--그림을 효과적으로 사용 ^^--중간에 막힌다면 ^^^^4장. 회의록 ^^--목적 - 결정사항의 확인 정보 공유 ^^--목표 - 결정사항과 토의 내용을 쉽게 정리한다 ^^--작성 요점 ^^^^5장. 제안서 ^^--목적 - 아이디어?플랜의 공감?납득을 얻어 상대방을 설득 ^^--목표 - 직감적으로 이미지를 떠올릴 수 있는 제안서로 상대의 공감을 얻는다 ^^--제안서 작성의 요점 ^^--전문?업계 용어를 피한다 ^^--제안서 작성 사례^^^^6장. 보고서 ^^--목적 - 읽는 상대에게 시행 결과를 전달한다 ^^--읽는 사람 - 누가 읽어도 이해할 수 있도록 ^^--보고서 작성의 요점 ^^^^7장. 메일 ^^--목적 - 사업상의 커뮤니케이션 전반 ^^--목표 - 인식과 이해 ^^^^8장. 탄원서 ^^--목적 - 결정사항의 변경을 문서로 설득 ^^--상대방은 탄원서에 흥미가 없다 ^^--논리를 정연하게 하고 단순 명쾌하게 전개한다 ^^--상대의 공감을 얻어 신뢰를 얻는다 ^^--탄원서에 필요한 요소 ^^^^9장. 문서 공략 요점^^^^특집 6. 기술자의 제안서 작성 바이블^^^^1장. 제안서 없이는 일도 없다 ^^--시작하며 ^^--제안서 없이는 일도 없다 ^^--제안서는 남는다 ^^--기술자가 제안서를 작성할 때의 장점 (업무 수준) ^^--기술자가 제안서를 작성할 때의 장점 (자기 성장 수준) ^^--기술자가 제안서를 작성할 때의 유의사항 ^^^^2장. 제안서를 작성하기 위한 사전 작업 ^^--시작하며 ^^--먼저 배경과 문제에 대해서 고객과 인식을 공유한다 ^^--제안 대상 범위를 명확하게 정리한다 ^^--자신과 회사의 액션을 검토한다 ^^--효과 예측과 위험 분석 ^^--액션을 단위 작업화한다^^--공수와 스케줄의 견적을 낸다 ^^--마지막으로^^^^3장. 제안서에 반영한다 ^^--시작하며 ^^--좋은 제안서의 작성 요령 ^^--프레젠테이션 자료를 작성 ^^--제안서의 수정 ^^--빠른 피드백 ^^--자사의 입장을 바꾸지 않는다 ^^--마지막으로^^^^특집 7. 프로젝트 인간관계 구축 기술^^^^1장. 프로젝트에 자주 보이는 곤란한 사람  ^^--시작하며 ^^--곤란한 사람의 특징 ^^--곤란한 사람의 종류 ^^^^2장. 리더가 되면 처음에 해야 할 인간관계 구축 기술  ^^--시작하며 ^^--주위의 관계자를 잘 파악하자 ^^--PM과 밀접한 관계를 만들자 ^^--고객의 요구를 이해하자 ^^--구성원을 이해하자 ^^^^3장. 구성원의 의욕을 고무시키는 기술 ^^--시작하며 ^^--가장 중요한 것 - 자기 자신이 곤란한 사람이 되지 않는다 ^^--의욕을 만드는 것 ^^--곤란한 구성원에 대한 대처 방법 ^^--팀 운영의 몇 가지 기술 ^^--마지막으로^^^^4장. 곤란한 고객?거래처의 경향과 그에 따른 대책  ^^--시작하며 ^^--계약 당시의 요구를 점점 마음대로 확대 해석하여 여러 가지 요구사항을 강요하는 사람 ^^--알고 있는 척하는 사람 ^^--사양하지 말고 솔직하게 말해달라고 하면서 그대로 이야기하면 화내는 사람 ^^--자신의 생각만을 고집하여 전체를 보지 못하는 사람 ^^--마지막으로 ^^^^5장. 곤란한 상사나 고객을 상대하기 위한 정치력 입문  ^^--끊으려 해도 끊지 못하는 그 사람과의 관계 ^^--이야기를 듣게 하고 싶을 때 ^^--생각을 바꾸게 하고 싶을 때 ^^--어떠한 사람에게도 천적은 있다 ^^^^6장. 정말 곤란한 사람을 추궁하는 단계적 대처 방법  ^^--시작하며 ^^--1단계: 다른 사람과 문제를 공유하자 ^^--2단계: 강제적으로 자기 인식을 시키는 상황을 만든다 ^^--3단계: 자각/자각 없음에 관계 없는 상황을 만든다 ^^--4단계: 본인에게 선고한다^^^^특집 8. 논리적 사고 실천 입문^^^^1장. 논리적 사고로 무엇이 얻어지는가?  ^^--여러분을 행복하게 하는 논리적 사고 ^^--논리적 사고를 실천하면 같은 일이라도 효과가 변화한다 ^^^^2장. 논리적이란 어떤 것인가? ^^--논리적인 사고는 커뮤니케이션의 기본 ^^--논리적으로 말하기 위한 조건 ^^--비판적으로 생각한다 ^^--Zero Base로 생각한다 ^^--마지막으로^^^^3장. 논리의 구조화로 표현력과 이해력을 기른다 ^^--논리를 구조화해야 하는 필요성 ^^--논리를 구조화하기 위해서는? ^^--논리 트리 ^^--논리 트리의 요점 ^^--MECE - 누락과 중복을 없애다 ^^--논리를 구조화할 때의 네 가지 이점 ^^--논리 트리에는 몇 가지 종류가 있다 ^^--마지막으로 ^^^^4장. 논리적으로 전달하기 위한 요점 ^^--논리적인 문장을 어떻게 작성해야 좋은가? ^^--사업 문서를 작성할 때의 요점 ^^--긴급 메시지를 어떻게 효율적으로 알기 쉽게 전달할 수 있는가? ^^--마지막으로, 바로 실천하고 반복하는 것이 중요접기",
    BOOK_INTRODUCTION:
      "수탁 개발을 뒷받침하는 기술, 업무, 인간관계에 대한 공략서. 이 책은 단순한 방법론적인 지식이 아닌 여러 저자들이 실제로 체험하고 습득한 실전적인 노하우에 대해서 설명하고 있다. 시스템 요건 정의, 프로젝트 관리 기법, 프로젝트 관리자의 역할, 대표적인 업무 시스템의 기본적인 지식과 문서 작성까지 다루고 있다. 또한 실제로 프로젝트를 수행하면서 발생할 수 있는 프로젝트 팀원 및 고객사와의 커뮤니케이션 방법에 대해서도 다루고 있다.^^^^전문 직업인으로서의 인생을 어떻게 걸어나갈 것인가? 이것은 누구에게 중요한 화두다. 특히 기술 진화가 빠르고 '프로그래머 35세 정년설'도 있는 이 업계에서 일하는 여러분들은 고민이나 불안도 그만큼 크다고 생각한다. 이 책은 지금까지의 10년을 돌아보고 앞으로의 10년을 고민하여 엔지니어로서 살아남기 위한 사고방식이나 노하우를 전달하는 것으로 시작한다.^^^^어떻게 하면 고객의 희망사항을 잘 추려서 시스템에 반영해야 하는가? 실제로 불편하다고 느끼는 점을 말이나 문장으로 빠짐없이 나타내는 것은 매우 어려운 작업이다. 특집 1에서는 여러분이 꼭 알아야 할 요건 정의의 사고방식에 대한 효과적인 방법을 소개한다. 또한 업무에서 작성해야 하는 갖가지 문서(설계서, 사양서, 기술 문서, 매뉴얼, 회의록, 제안서 등)에 대한 작성 노하우도 알기 쉽게 설명해놓았다.",
    PUBLISH_DATE: "2014-03-31",
    Allah_BID: "38696576",
    thumbnailImage: "http://203.255.3.144:8010/thumbnail/38696576.png",
  },
  {
    BID: 797,
    TITLE: "지능형 사물인터넷 프로그래밍",
    SUBTITLE: null,
    AUTHOR: "천상훈 지음",
    ISBN: "9791166750601",
    PUBLISHER: "복두출판사",
    PRICE: "11,000원",
    PAGE: "174쪽",
    BOOK_INDEX:
      "PART 1  우분투 리눅스 기초^^^^CHAPTER 01  우분투 리눅스 기본^^1.1  기본 명령어^^1.2  IP 주소 정보^^1.3  vi 편집기^^1.4  패키지 관리^^^^CHAPTER 02  셸 스크립트^^2.1  셸 개념^^2.2  셸 스크립트 프로그래밍^^^^PART 2  젯슨 나노 활용^^^^CHAPTER 03  젯슨 나노 개발환경 구축^^3.1  장비 목록^^3.2  개발 환경 구축하기^^3.3  참고 사이트^^^^CHAPTER 04  FAN 제어^^4.1  팬 수동 제어^^4.2  팬 자동 제어^^4.3  팬 설정^^4.4  참고 사이트^^^^CHAPTER 05  OpenCV 설치하기^^5.1  설치 준비^^5.2  비디오 및 이미지 라이브러리 설치^^5.3  OpenCV 설치^^5.4  참고 사이트^^^^CHAPTER 06  PI 카메라 사용하기^^6.1  IMX219 CSI 카메라 시험^^6.2  OpenCV 활용^^6.3  USB 웹 캠 사용^^6.4  참고 사이트^^^^CHAPTER 07  AI 얼굴 인식^^7.1  사진 100장 찍기^^7.2  사진 100장 학습하기^^7.3  얼굴 인식하기^^7.4  참고 사이트^^^^CHAPTER 08  GPIO 활용^^8.1  GPIO 개념^^8.2  GPIO 사용하기^^8.3  참고 사이트^^^^CHAPTER 09  스마트 LED^^9.1  AI 융합 GPIO 제어^^^^CHAPTER 10  스마트 도어락^^10.1  AI 융합 도어락 코드^^10.2  AI 융합 도어락 하드웨어^^10.3  AI 융합 도어락 동작^^10.4  참고 사이트^^^^CHAPTER 11  젯슨 나노 백업 및 복구^^11.1  젯슨 나노 백업^^11.2  젯슨 나노 복구^^11.3  참고 사이트^^^^PART 3  지능형 사물인터넷 구현^^^^CHAPTER 12  블링크(Blynk) 앱^^12.1  블링크(Blynk) 서버  개발 환경 구축^^12.2  스마트폰에 블링크 앱 설치 및 프로젝트 생성^^12.3  기본적인 IoT 제어 파이썬 프로그램 작성^^12.4  LED On_Off 제어^^12.5  스마트 LED On_Off 제어^^12.6  스마트 도어락 시스템 구현^^12.7  참고 사이트접기",
    BOOK_INTRODUCTION:
      "AI 하드웨어 개발자의 기초적인 실무 역량 강화를 위한 목적으로 저술된 교재다. 리눅스 기본, 젯슨 나노 개발 도구, 블링크를 활용하여 지능형 사물인터넷을 구현하고 실습해 봄으로써 기본적인 AI 하드웨어 활용 역량을 강화하고자 하였다. 총 3부로 구성된다.^^^^1부 리눅스 기초에서는 우분투 리눅스 기본, 셸 스크립트를 다룬다. 2부 젯슨 나노 활용은 젯슨 나노 개발 환경 구축, FAN 제어, OpenCV 설치, PI 카메라 사용, AI 얼굴 인식, GPIO 활용, AI 얼굴 인식을 활용한 LED On/Off, AI 얼굴 인식을 활용한 도어락 On/Off를 다룬다. 3부 지능형 사물인터넷(IoT) 구현은 블링크 앱을 다룬다.",
    PUBLISH_DATE: "2021-08-20",
    Allah_BID: "278826192",
    thumbnailImage: "http://203.255.3.144:8010/thumbnail/278826192.png",
  },
  {
    BID: 882,
    TITLE: "솔리드웍스 정적구조 및 유체유동 공학해석 기초",
    SUBTITLE: null,
    AUTHOR: "이상만 지음",
    ISBN: "9791189757229",
    PUBLISHER: "명인북스",
    PRICE: "30,000원",
    PAGE: "310쪽",
    BOOK_INDEX:
      "제1장 정적구조 해석^^^^1-1. 공학기초 이론^^1-1-1. 단위계와 기본물리량 및 규격의 표준화^^1-1-2. 공학이론 (재료역학)^^1-1-3. 유한요소 해석이론^^^^1-2. 해석기초 및 일반사항^^1-2-1. 해석결과의 신뢰성 및 기초해석기법^^1-2-1-1. 메시 밀도^^1-2-1-2. 구조적결함 및 메시 컨트롤(MC)^^1-2-1-3. 자동세분화(h-A) 해석기법^^1-2-1-4. 설계스터디(DS-1) 해석기법^^1-2-1-5. 개별실습 예제 ( Ⅰ )^^1-2-2. Assembly 해석^^1-2-2-1. 단일부품 vs assembly^^1-2-2-2. 접촉유형과 상당설정^^1-2-2-3. 거동구속^^1-2-2-4. 연결유형과 결과분석^^1-2-2-5. 개별실습 예제 ( Ⅱ ) ^^^^제2장 열 및 유체유동 해석^^^^2-1. 공학기초 이론^^2-1-1. 기본물리량^^2-1-2. 공학이론 (유체역학, 열역학, 열전달)^^2-1-3. 유한체적요소 해석이론^^^^2-2. 해석기초 및 일반사항^^2-2-1. 해석모델의 준비와 검사^^2-2-2. 해석트리의 구성^^2-2-3. 내부유동 vs 외부유동^^2-2-4. 입자스터디^^2-2-5. 유동의 가시화 (해석결과의 분석)^^2-2-6. 유체유동 vs 열 유동 ^^^^제3장 개별실습 참조사항 및 참조플롯^^3-1. 개별실습 예제 ( Ⅰ )^^3-2. 개별실습 예제 ( Ⅱ )^^3-3. 개별실습 예제 ( Ⅲ )^^^^. Appendix^^. 개별 평가항목(SWSS)^^. 개별 평가항목(SWFS) 접기",
    BOOK_INTRODUCTION:
      "본서는 솔리드웍스 해석기초의 가장 기본적인 내용을 중심으로 해석논리 습득을 위하여 기초과정을 학습하기 위한 17개의 모델로 작성되었다.",
    PUBLISH_DATE: "2021-07-30",
    Allah_BID: "274947559",
    thumbnailImage: "http://203.255.3.144:8010/thumbnail/274947559.png",
  },
  {
    BID: 12,
    TITLE: "AI시대의 컴퓨터 개론",
    SUBTITLE: null,
    AUTHOR: "강환수 외 지음",
    ISBN: "9791185578958",
    PUBLISHER: "인피니티북스",
    PRICE: "29,000원",
    PAGE: "604쪽",
    BOOK_INDEX:
      "Chapter 01 인공지능과 함께하는 우리 사회^^1.1 가상 세계, 메타버스^^1.2 인공지능과 삶의 변화^^1.3 인터넷 콘텐츠 서비스^^1.4 제4차 산업혁명 시대^^내용 점검 문제^^^^Chapter 02 컴퓨터 개요^^2.1 컴퓨터란 무엇인가?^^2.2 하드웨어란?^^2.3 소프트웨어란?^^2.4 컴퓨터의 기원^^2.5 컴퓨터의 발전^^2.6 컴퓨터의 종류^^내용 점검 문제^^^^Chapter 03 정보의 표현^^3.1 컴퓨터의 자료 표현^^3.2 지수와 수의 표현^^3.3 컴퓨터의 정보 종류^^3.4 문자와 논리 표현^^3.5 컴퓨터의 연산^^내용 점검 문제^^^^Chapter 04 컴퓨터 구조^^4.1 폰 노이만의 저장 프로그램^^4.2 다양한 기억장치^^4.3 중앙처리장치 CPU^^4.4 프로그램 실행 과정^^4.5 마이크로프로세서^^내용 점검 문제^^^^Chapter 05 운영체제와 활용^^5.1 운영체제 개요^^5.2 운영체제 관리^^5.3 운영체제의 분류^^5.4 다양한 운영체제의 종류^^5.5 윈도우 운영체제 활용^^내용 점검 문제^^^^Chapter 06 인공지능과 딥러닝^^6.1 인공지능 개요^^6.2 머신러닝과 딥러닝^^6.3 인공신경망과 딥러닝^^내용 점검 문제^^^^Chapter 07 컴퓨팅 사고력과 문제해결^^7.1 컴퓨팅 사고력 개요^^7.2 컴퓨팅 사고력 준비: 자료 수집, 자료 분석과 표현^^7.3 컴퓨팅 사고력 시작: 문제 분해^^7.4 컴퓨팅 사고력 핵심: 패턴인식과 추상화^^7.5 컴퓨팅 사고력 구현: 알고리즘과 자동화^^내용 점검 문제^^^^Chapter 08 프로그래밍 언어^^8.1 프로그래밍 언어 개요^^8.2 프로그램 구현^^8.3 고급 프로그래밍 언어 종류^^8.4 객체지향 프로그래밍^^내용 점검 문제^^^^Chapter 09 데이터베이스^^9.1 데이터베이스 개요^^9.2 데이터베이스 구조^^9.3 데이터베이스 모델^^9.4 관계형 모델^^9.5 데이터베이스 관리시스템^^9.6 데이터 마이닝과 문서데이터베이스^^내용 점검 문제^^^^Chapter 10 컴퓨터 네트워크와 월드와이드웹^^10.1 네트워크 개요^^10.2 네트워크 장치와 교환 방식^^10.3 네트워크의 분류^^10.4 네트워크의 활용 및 이해^^10.5 인터넷 개요^^10.6 인터넷 동작원리^^10.7 월드와이드웹(WWW)^^10.8 웹 프로그래밍^^내용 점검 문제^^^^Chapter 11 제4차 산업혁명과 첨단기술^^11.1 제4차 산업혁명시대 고찰^^11.2 초연결 사회의 모바일과 클라우드 컴퓨팅^^11.3 지능형 로봇과 첨단기술^^내용 점검 문제^^^^Chapter 12 멀티미디어 개론^^12.1 멀티미디어 개요^^12.2 멀티미디어 시스템^^12.3 데이터 처리^^12.4 압축^^12.5 멀티미디어 활용^^12.6 멀티미디어 보안^^내용 점검 문제^^^^Chapter 13 정보보안^^13.1 정보보안 개념^^13.2 컴퓨터 바이러스^^13.3 악성 프로그램과 해킹^^13.4 암호화 기술^^13.5 인터넷 보안^^13.6 정보 윤리^^내용 점검 문제^^^^참고문헌 및 자료 출처^^찾아보기접기",
    BOOK_INTRODUCTION:
      "인공지능 시대에 필요한 컴퓨터 기초 지식, 컴퓨팅 사고에 대해 설명하고 빅데이터, 블록체인, 자율주행, 지능형 로봇까지 첨단기술을 소개한다. 인공지능 챕터를 별도로 구성하여 인공지능의 기초부터 심화까지 초보자 눈높이에 맞춰 쉽게 풀어서 설명했다.",
    PUBLISH_DATE: "2022-02-17",
    Allah_BID: "289275287",
    thumbnailImage: "http://203.255.3.144:8010/thumbnail/289275287.png",
  },
  {
    BID: 351,
    TITLE: "데이터 통신과 네트워킹",
    SUBTITLE: null,
    AUTHOR: "Behrouz A. Forouzan 지음, 이재광 외 옮김",
    ISBN: "9791132110811",
    PUBLISHER: "원제 : Data Communications and Networking",
    PRICE: "39,000원",
    PAGE: "830쪽",
    BOOK_INDEX:
      "Chapter 01 개요 ^^Chapter 02 물리층 ^^Chapter 03 데이터 링크층 ^^Chapter 04 근거리 통신망: LAN ^^Chapter 05 광역 통신망: WAN ^^Chapter 06 연결 장치와 가상 LAN ^^Chapter 07 네트워크층: 데이터 전송 ^^Chapter 08 네트워크층: 패킷의 라우팅 ^^Chapter 09 전송층 ^^Chapter 10 응용층 소개 ^^Chapter 11 멀티미디어 ^^Chapter 12 네트워크 관리 ^^Chapter 13 암호화와 네트워크 보안 ^^Appendix A 유니코드 ^^Appendix B 숫자 시스템 ^^Appendix C HTML, CSS, XML, XSL ^^Appendix D 기초 확률론 ^^Appendix E 검사합 ^^약어 ^^용어해설 ^^찾아보기접기",
    BOOK_INTRODUCTION:
      "TCP/IP 프로토콜을 기반으로 한 네트워킹의 원리를 설명하였다. TCP/IP 프로토콜의 각 계층은 하위 계층에서 제공하는 서비스를 이용하여 구축된 상향식 접근방법을 사용하였다. 이 6판은 TCP/IP 프로토콜에 초점을 맞추어 장의 수를 줄여서 재구성하였다. 마지막에는 멀티미디어, 네트워크 관리 및 암호학/네트워크 보안을 살펴보는 세 개의 장으로 결론을 맺었다.",
    PUBLISH_DATE: "2021-12-01",
    Allah_BID: "284242293",
    thumbnailImage: "http://203.255.3.144:8010/thumbnail/284242293.png",
  },
  {
    BID: 1280,
    TITLE: "파이썬으로 배우는 머신러닝 입문",
    SUBTITLE: null,
    AUTHOR: "오제키 마사유키 지음, 김성훈 옮김",
    ISBN: "9788931589412",
    PUBLISHER: "성안당",
    PRICE: "19,800원",
    PAGE: "408쪽",
    BOOK_INDEX:
      "제1장 마법 거울과의 만남^^1-1 신비한 언어 파이썬?^^1-2 고대 문명과 마법 거울^^1-3 깊은 숲속에서^^1-4 마법의 의식^^1-5 난수 발생시키기^^1-6 그래프로 결과 표시하기^^1-7 두 종류의 다른 데이터^^<왕비님의 학습 노트 1> 두 종류의 데이터를 준비한다^^^^제2장 머신러닝의 발견^^2-1 신경망 구축하기^^2-2 신경망의 학습^^2-3 수행 성과 살펴보기^^2-4 신경망의 한계^^<왕비님의 학습 노트 2> 신경망을 만든다^^^^제3장 추억의 붓꽃^^3-1 붓꽃 데이터 읽어들이기^^3-2 붓꽃 데이터 식별하기^^3-3 신경망이 깨어날 때^^3-4 비선형 변환 때문에 빽빽해?^^3-5 학습의 정체기^^<왕비님의 학습 노트 3> 붓꽃의 식별^^^^제4장 이미지 데이터의 학습^^4-1 손글씨 인식하기^^4-2 현대의 난쟁이들^^4-3 자작 마법 모으기^^4-4 패션 식별에 도전하기^^<왕비님의 학습 노트 4> 자작 함수로 정리한 신경망^^^^제5장 미래의 예측^^5-1 패션 식별에 도전하기^^5-2 어떤 비선형 변환이 좋을까?^^5-3 심층 신경망^^5-4 시계열 분석에 도전하기^^5-5 거래 데이터 예측하기^^<왕비님의 학습 노트 5> 주가를 예측하는 신경망^^^^제6장 심층 학습의 비밀^^6-1 일반 물체 인식에 도전하기^^6-2 합성곱 신경망^^6-3 확률 경사법의 등장^^6-4 더 깊은 네트워크를 만들기 위해^^6-5 일반화 성능을 끌어올리기 위한 연구^^6-6 편리한 신경망 구축하기^^6-7 합성곱 신경망을 반대로?^^<왕비님의 학습 노트 6> 합성곱 신경망^^^^제7장 적대적 생성 네트워크^^7-1 자신의 데이터셋 준비하기^^7-2 가짜를 만드는 생성 네트워크^^7-3 백설공주와의 이별^^7-4 왕비님과의 만남^^^^왕궁 도서관 추천 도서(참고 문헌)^^백설공주가 마지막으로 건 마법 주문접기",
    BOOK_INTRODUCTION:
      "동화같은 유럽풍 판타지 원단의 스토리를 따라가면서 파이썬으로 머신러닝 프로그래밍을 다루는 입문서로 등장 인물의 파이썬 학습 노트에 적혀 있는 샘플 코드와 설명을 읽어보며 즐기면서 프로그래밍을 할 수 있다. 또한 쉽게 이해할 수 있도록 각 작업 과정과 필요한 라이브러리를 정리하여 프로그램을 모듈화하고 있으며, 실제로 코딩하면서 이해할 수 있는 구성이다.",
    PUBLISH_DATE: "2021-04-30",
    Allah_BID: "269811504",
    thumbnailImage: "http://203.255.3.144:8010/thumbnail/269811504.png",
  },
  {
    BID: 1635,
    TITLE: "R을 활용한 의료데이터 핸들링",
    SUBTITLE: null,
    AUTHOR: "주형준 지음",
    ISBN: "9788955662443",
    PUBLISHER: "한나래출판사",
    PRICE: "22,000원",
    PAGE: "200쪽",
    BOOK_INDEX:
      "ch. 1 R 기초^^^^1 R 시작하기^^1-1 R 설치 및 R Studio 세팅^^1-2 패키지^^^^2 R 기본 활용법^^2-1 R 데이터 구조 및 기초 문법^^2-2 함수 및 패키지 활용^^^^ch. 2 데이터 전처리^^^^1 프로젝트의 시작^^^^2 데이터 정리하기^^2-1 데이터 관리 및 불러오기^^2-2 데이터 삭제하기^^2-3 날짜 변수 정리하기^^2-4 그 밖의 변수 정리하기^^2-5 변수 새로 만들기^^^^3 탐색적 데이터 분석^^3-1 카테고리형 변수 분석하기^^3-2 수치형 변수 분석하기^^3-3 날짜 오류 확인하기^^^^4 데이터 분할 및 관리^^4-1 데이터 나누기^^4-2 데이터 합치기^^^^ch. 3 데이터 분석 및 시각화^^^^1 데이터 그룹핑하기^^^^2 데이터 분석 및 시각화^^2-1 그룹별 단면 분석하기^^2-2 연구 종점 및 기간 변수 만들기^^2-3 연구 결과 분석하기접기",
    BOOK_INTRODUCTION:
      "R을 이용한 효율적인 데이터 핸들링 안내서. 이 책의 첫 번째 목적은 ‘R을 이용한 효율적인 데이터 핸들링 과정’을 소개하는 것이다. 방대한 양의 데이터를 Excel에 입력해 수작업으로 작업하기란 거의 불가능하다. R은 데이터 분석뿐만 아니라 데이터 핸들링 작업에도 매우 유용한 프로그램이다. R을 사용하면 코딩을 통해서 데이터가 정리되는 과정을 다시 되새길 수 있고, 연구자가 원하는 시점에 데이터 정리 방식에 얼마든지 변화를 줄 수 있다. 또한 풍부한 통계 및 시각화 패키지를 통해 여러 가지 분석을 수행하고 그래프도 만들 수 있다.^^^^이 책의 두 번째 목적은 ‘임상의학 연구에 특화된 실질적인 데이터 핸들링 과정’을 소개하는 것이다. 임상의사로서 수년 동안 R을 활용해 연구를 진행해온 저자는 수많은 시행착오를 겪으면서 효율적인 데이터 핸들링에 관한 노하우를 터득했다. 이에 R 데이터 분석을 다룬 도서들이 이미 많이 나와 있음에도 불구하고, 임상의학 연구에 특화된 실질적인 데이터 전처리 과정을 소개하고자 이 책을 집필하였다.",
    PUBLISH_DATE: "2021-02-05",
    Allah_BID: "263311658",
    thumbnailImage: "http://203.255.3.144:8010/thumbnail/263311658.png",
  },
  {
    BID: 10622,
    TITLE: "제품디자인을 위한 Rhino 3D 5 Reality",
    SUBTITLE: null,
    AUTHOR: "김상윤 지음",
    ISBN: "9788960881358",
    PUBLISHER: "아이생각(디지털북스)",
    PRICE: "37,000원",
    PAGE: "648쪽",
    BOOK_INDEX:
      "Chapter 01 제품디자인과 Rhino 3D ^^  Lesson 01 제품디자인과 CAID^^    Section 01 제품디자인의 분야^^    Section 02 제품디자인 프로세스와 CAID^^^^  Lesson 02 제품디자인을 위한 Rhino 3D^^^^  Lesson 03 Rhino 3D 개요 및 특징^^    Section 01 Rhino 3D 기능 및 특징^^^^   Section 02 Rhino 3D 5의 대표적인 새로운 기능^^       1. 화면 인터페이스^^       2. Gumball Selection Tool^^       3. Continue Curve 기능^^       4. Shell 기능^^       5. Architectural Visuals^^       6. Sweep 개선^^       7. 진보된 Rendered 모드^^       8. ShutLining & Curve Piping^^^^  Lesson 04 Rhino 3D 5 평가버전 설치 및 실행^^    Section 01 Rhino 3D 5의 평가버전 다운로드 하기^^^^    Section 02 Rhino 3D 5의 평가버전 기본 설치 및 실행하기^^^^    Section 03 Rhino 3D 5의 설치사양^^        1. 하드웨어^^        2. 운영체제^^        3. 인터넷 연결  ^^        4. 지원하지 않는 사양^^^^Chapter 02 Rhino 3D 5의 전반적인 이해 ^^  Lesson 01 Rhino 3D 5의 화면 인터페이스 살펴보기^^   Section 01 Viewport의 이해 및 조정하기^^        1. 전체화면 구성 살펴보기 ^^        2. Zoom  ^^        3. Pan  ^^        4. Rotate View^^       5. Set View  ^^        6. 단축키 모음 ^^^^   Section 02 Display Modes 옵션 다루기^^        1. Wireframe Viewport  ^^        2. Shaded Viewport  ^^        3. Shade^^        4. Rendered Viewport^^        5. Ghosted Viewport ^^        6. X-ray Viewport^^        7. Technical Viewport^^        8. Pen Viewport^^        9. Artistic Viewport ^^        10. Flat Shade Mode^^        11. Shade Selected Objects Only^^^^  Lesson 02 Rhino 3D 모델링에 도움을 주는 주요 기능들^^   Section 01 모델링을 하기 위한 기초 명령 살펴보기^^       1. Gumball Rhino 5.0 신기능^^^^        2. Elevator^^       3. Tab key^^       4. Distance Constraint^^       5. Angle Constraint^^       6. Toggle ortho mode / Turn ortho mode On / Off^^       7. Set the ortho angle^^       8. Toggle planar mode / Turn planar mode On / Off^^       9. Toggle snap mode / Turn snap mode On / Off^^       10. Grid^^        11. Control Point On / Off^^        12. Record History^^        13. SmartTrack On / Off^^        14. SmartTracking Options^^^^   Section 02 Select Objects^^         1. Select Objects^^         2. Select All^^         3. Invert Selection^^         4. Invert Control Point Selection^^         5. Lasso Points^^         6. Window Selection^^         7. Crossing Selection^^^^   Section 03 Object Visibility^^        1. Hide Objects / Show Objects^^        2. Lock Objects / Unlock Objects^^        3. Unlock Selected Objects^^        4. Invert Selection and Hide Objects^^        5. Invert Selection and Lock Objects^^        6. Swap Locked and Unlocked Objects^^        7. Swap Hidden and Visible Objects^^        8. Show Selected Objects^^^^   Section 04 Layer^^        1. Layer 지정^^        2. Layer의 세부 주요 기능들 ^^        3. Layer Floating Toolbar^^^^   Section 05 Object Snap^^        1. Object Snap^^        2. Object Snap의 세부 선택 기능들^^^^^^Lesson 03 모델링에 가장 많이 쓰이는 공용편집 도구^^   Section 01 Join, Explode 명령^^        1. Join ^^        2. Explode / Extract Surface^^^^   Section 02 Trim, Split 명령^^        1. Trim / Untrim Surface^^        2. Split / Split Surface by Isocurve^^^^   Section 03 Project 명령^^         1. Project curves^^         2. Pull Curve^^^^Chapter 03 Rhino 3D 초·중급 제품 모델링 따라하기^^  Lesson 01 간단한 유리컵 모델링과 Neon 렌더링^^   Section 01 Curve로 기본도면 그리기^^^^  Section 02 Revolve로 입체 만들고 Neon으로 디스플레이 하기^^     1. Revolve로 회전체 만들기^^     2. Neon 디스플레이 모드로 설정한 후 재질 적용하기^^     3. 물 만들고 HDR 환경 맵 적용하기^^     4. 물 재질 변경하고 얼음 조각 만들기^^^^  Section 03 유리컵 렌더링 장면 파일로 저장하기^^^^^^  Lesson 02 모나미 볼펜^^   Section 01 모나미 볼펜의 육각 배럴 만들기^^   Section 02 모나미 볼펜의 선단(Front Section) 만들기^^   Section 03 모나미 볼펜의 노크 버튼 만들기^^   Section 04 모나미 볼펜심 만들기^^   Section 05 모나미 볼펜에 로고 새기기^^       1. Text object로 로고 만들기^^       2. Decals 명령으로 로고 매핑하기^^^^Lesson 03 화장품 용기^^   Section 01 화장품 용기 도면 그리기^^^^   Section 02 화장품 용기 입체로 만들기^^     1. 화장품 외부 용기 만들기^^     2. 준비된 화장품 내부 용기 사용하기^^     3. 내부 용기와 합치고 나머지 모델링하기^^     4. 머리 부분의 나선형 구조 만들기^^     5. 뚜껑 부분의 나선형 구조 만들기 ^^^^  Section 03 화장품 뚜껑과 용기에 글자 새기기^^^^^^  Lesson 04 RIN Chair^^   Section 01 의자 시트 모델링 하기^^^^  Section 02 의자 다리 모델링 하기^^^^  Section 03 의자 이동용 바퀴 만들기^^^^^^ Lesson 05 Latte Miffy MP3 Player^^   Section 01 Miffy MP3 Player 도면 설정^^     1. 미피 도면 배치하기^^     2. 미피 도면 각 Layer에 할당하기^^^^   Section 02 Miffy의 머리, 몸통, 팔, 손 만들기^^^^   Section 03 Miffy의 귀와 다리 만들기^^^^   Section 04 Miffy의 눈과 입 / 로고 만들기^^       1. 얼굴에 눈과 입 적용하기^^       2. 가슴에 로고 새기기^^^^   Section 05 Miffy의 양팔에 Power Key와 Mode Key 만들기^^^^   Section 06 Miffy의 이어폰 잭 홀 / 스트립 홀 만들기^^      1. 이어폰 잭 홀 만들기^^      2. 스트립 홀 만들기^^^^   Section 07 Miffy의 조그(Jog Key) 만들기^^^^Lesson 06 Logitech Mobile Freedom Bluetooth Headset ^^   Section 01 블루투스 헤드셋 상단 Body 만들기^^      1. 평면도면 불러와 정렬하기^^      2. 상단 Body의 Curve와 개체 만들기^^   Section 02 블루투스 헤드셋 하단 Body 만들기^^      1. 회전 클립 거치대와 스피커 만들기^^      2. 회전 클립과 부속품 만들기^^^^Lesson 07 INNOV HAIR DRYER^^   Section 01 헤어 드라이어 몸체와 토출구 만들기^^      1. 헤어 드라이어 평면도면 불러오기^^      2. 헤어 드라이어 몸체 만들기^^      3. 헤어 드라이어 토출구 만들기^^^^   Section 02 헤어 드라이어 흡입구 만들기^^^^  Section 03 헤어 드라이어 손잡이 만들기^^    1. 헤어 드라이어 손잡이 몸체 만들기^^    2. 헤어 드라이어의 벽걸이용 고리 만들기^^    3. 손잡이의 그립 만들기^^    4. 헤어 드라이어 조작버튼 만들기^^^^ Section 04 헤어 드라이어 Neon으로 렌더링 하기^^^^Lesson 08 콜라 병 ^^   Section 01 콜라병 Body 만들기^^      1. 이미지 배치하고 바깥 면과 안쪽 면 만들기^^      2. 바깥 면의 주름 라인 만들기^^^^   Section 02 콜라병의 병뚜껑 만들기^^^^   Section 03 콜라병에 재질 및 로고 적용하기^^       1. Decal 명령으로 로고 적용하기^^       2. Create UV curves와 Apply UV curves 명령으로 로고 적용하기^^^^Lesson 09 Vans Shoe^^   Section 01 Vans Shoe의 신발 하부 만들기^^     1. Vans Shoe 도면 불러와 정렬하기^^     2. 하단 부분 밑창(Sole) 만들기^^^^   Section 02 Vans Shoe의 상단 부분(Upper) 만들기^^     1. Vans Shoe 상단 부분(Upper)만들기^^     2. Vans Shoe 아일렛(Eyelet)과 신발 끈(Shoes Lace)과 만들기^^     3. Vans Shoe의 라벨(Label)과 실(Thread) 만들기^^     4. Vans Shoe에 재질과 매핑 적용하기^^     5. Vans Shoe의 밑창 바닥에 Displacement Map적용하기^^^^Chapter 04 Luxion KeyShot을 활용한 렌더링 ^^ Lesson 01 KeyShot의 이해 ^^    Section 01 KeyShot과 HDRI^^^^    Section 02 KeyShot의 특징^^^^    Section 03 KeyShot 설치 및 시스템 요구사항^^         1. KeyShot 설치하기^^         2. KeyShot의 시스템 요구사항^^^^   Section 04 KeyShot의 화면구성^^         1. 전체 메인 구성 살펴보기^^         2. Docking Window 기능^^^^    Section 05 KeyShot Main Toolbar 살펴보기^^      1. Import^^      2. Library^^      3. Project ^^      4. Animation^^      5. Screenshot^^      6. Render^^      7. KeyShot VR^^^^Lesson 02 Bluetooth Headset을 KeyShot으로 렌더링하기^^    Section 01 Bluetooth Headset 각 Layer로 분리하기^^^^    Section 02 KeyShot에서 재질 적용하기^^^^    Section 03 HDR 환경 맵 적용하고 렌더링하기^^       1. HDR 환경 맵 적용하기^^       2. 카메라 설정하기^^       3. 렌더링 옵션 설정하기^^       4. Render Queue (렌더링 대기열)^^^^     Section 04 KeyShot VR 적용하기^^접기",
    BOOK_INTRODUCTION:
      "하드웨어 기술의 발달로 Rhino 3D 5 버전에 달라진 화면구성과 추가된 막강한 기능들과 개선된 명령들은 사용자로 하여금 즐거움을 주고 있다. 특히 타 3D 프로그램에서만 볼 수 있었던 Transform Gizmo 같은 Gumball Selection Tool은 작업속도의 성능을 최대한 끌어주고 있으며, 단조로운 오브젝트 표면에 부품간의 영역 표시선을 만들어 주는 ShutLining 명령은 Rhino 3D 유저에게 큰 기쁨을 주고 있다.^^^^이 책은 Rhino 3D 5에 새롭게 바뀐 기능들을 다양한 예제를 통해 최대한 많이 실릴 수 있도록 노력하였다. 초.중급의 모델링의 예제를 처음부터 끝가지 직접 따라함으로써 새롭게 바뀐 Rhino3D 5의 다양한 메뉴와 여러 기능들을 익혀보도록 하였으며, 무료 플러그인의 NEON 설치법과 Rhino 3D와 연동하여 사실과 같은 렌더링 이미지가 나올 수 있도록 그 방법도 상세히 소개되고 있다.^^^^또한 후반부에는 최근의 업 버전으로 인하여 막강하게 새로워진 KeyShot 관련 내용과 렌더링을 위한 기능 소개 및 사용방법도 자세히 소개되어 있어 독자 스스로가 렌더링을 할 수 있도록 크게 유도하였다.",
    PUBLISH_DATE: "2014-03-15",
    Allah_BID: "36432237",
    thumbnailImage: "http://203.255.3.144:8010/thumbnail/36432237.png",
  },
];

// 로그인 모달의 OPEN / CLOSE 상태 관리
// 액션타입 정의 : 액션타입은 대문자로 정의, 문자열 내용은 "모듈이름 / 액션이름"
const UPDATE_HOME_BOOKS = "books/UPDATE_HOME_BOOKS";
const UPDATE_INTERESTS = "books/UPDATE_INTERESTS";
// const UPDATE_BOOK_DETAIL = "books/UPDATE_BOOK_DETALE";
const UPDATE_SEARCH_RESULT = "books/UPDATE_SEARCH_RESULT";

// 액션 생성함수. 함수를 만들고 타입을 지정. export 필수
export const updateHomeBooks = (books) => ({ type: UPDATE_HOME_BOOKS, books });
export const updateInterests = (books) => ({ type: UPDATE_INTERESTS, books });
// export const updateBookDetail = (books) => ({
//   type: UPDATE_BOOK_DETAIL,
//   books,
// });
export const updateSearchResult = (books) => ({
  type: UPDATE_SEARCH_RESULT,
  books,
});

//초기상태와 Reducer 정의
const initialState = {
  homeBooks: [
    {
      tag: "",
      data: [],
    },
  ],
  interests: dummy,
  // bookDetail: [],
  searchResult: [],
};

function books(state = initialState, action) {
  switch (action.type) {
    case UPDATE_HOME_BOOKS:
      return {
        ...state,
        homeBooks: action.books,
      };
    case UPDATE_INTERESTS:
      return {
        ...state,
        interests: action.books,
      };
    // case UPDATE_BOOK_DETAIL:
    //   return {
    //     ...state,
    //     bookDetail: action.book,
    //   };
    case UPDATE_SEARCH_RESULT:
      return {
        ...state,
        searchResult: action.books,
      };
    default:
      return state;
  }
}

export default books;
